#შექმენით ფუნქცია რომელსაც არგუმენტად გადაეცემა 
# რამე სტრინგი დაითვლის ამ სტრინგში ასო "i"ს 
# რაოდენობას და დააბრუნებს რიცხვად ამ მნიშვნელობას
############# პასუხი :
text = str(input("Enter a text: "))
L = len(text)
for i in range(L):
    def my_func(text):
        return text.count(text[i])
    print(my_func(text))


#შექმენით ფუნქცია რომელსაც არგუმენტად 
# გადაეცემა რაღაც რიცხვი
#დააბრუნოს მნიშვნელობად 1-იდან ამ რიცხვამდე 
# რიცხვების ჯამი.
#მაგალითად 4 -->   1+2+3+4 = 10
########## პასუხი:
def sum_func(x):
    sum = 0
    for i in range(int(x+1)):
        sum += i
    return sum
print(sum_func(4))

